In [2]:
import pandas as pd
import numpy as np

In [201]:
# skiprows : 맨 위의 11줄은 무시하고 불러옴
df = pd.read_csv('./pandas_datafiles/seoul_weather.csv', encoding = 'cp949', skiprows=11)

In [202]:
df.head(2)

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃) \t최고기온시각  최저기온(℃) 최저기온시각
0       108  서울  1907-10-01     13.5     20.7      NaN      7.9    NaN
1       108  서울  1907-10-02     16.2     22.0      NaN      7.9    NaN

In [203]:
# 필요없는 자료 삭제
df.drop(['\t\t지점번호','지점명','\t최고기온시각', '최저기온시각'], axis = 1, inplace = True)
df.head(2)

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0  1907-10-01     13.5     20.7      7.9
1  1907-10-02     16.2     22.0      7.9

In [188]:
# nan 값 있는지 확인
df.isnull().sum()

\t\t지점번호    0
지점명         0
일시          0
평균기온(℃)     0
최고기온(℃)     0
\t최고기온시각    0
최저기온(℃)     0
최저기온시각      0
일교차         0
dtype: int64

In [208]:
# column명을 사용하기 편하게 바꿈
df.columns = ['일시', '평온', '고온','저온']
df.head(5)

           일시    평온    고온    저온
0  1907-10-01  13.5  20.7   7.9
1  1907-10-02  16.2  22.0   7.9
2  1907-10-03  16.2  21.3  13.1
3  1907-10-04  16.5  22.0  11.2
4  1907-10-05  17.6  25.4  10.9

In [210]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40488 entries, 0 to 40487
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      40488 non-null  object
 1   평온      39732 non-null  float64
 2   고온      39730 non-null  float64
 3   저온      39731 non-null  float64
dtypes: float64(3), object(1)
memory usage: 1.2+ MB

In [189]:
# nan 값 채우기
df.fillna(method = 'bfill', inplace=True)
df.isnull().sum()

\t\t지점번호    0
지점명         0
일시          0
평균기온(℃)     0
최고기온(℃)     0
\t최고기온시각    0
최저기온(℃)     0
최저기온시각      0
일교차         0
dtype: int64

In [190]:
# 역대 최고기온인 날의 날짜
# df[df['최고기온(℃)'] == df['최고기온(℃)'].max()]['일시']
df.sort_values('최고기온(℃)', ascending=False).iloc[0]['일시']

'2018-08-01'

In [191]:
# 일교차가 가장 큰 월은?

df['일교차'] = df['최고기온(℃)'] - df['최저기온(℃)']
# df.sort_values('일교차', ascending=False).iloc[0]['일시'].split('-')[1]


df.groupby(df['일시'].str.split('-').str[1])['일교차'].mean().sort_values(ascending = False).index[0]

'10'

In [195]:
# 월교차가 가장 큰 월은? (월간 온도 분산)
# month_max = df.groupby(df['일시'].apply(lambda x : x.split('-')[0]))['최고기온(℃)'].max()
# month_min = df.groupby(df['일시'].apply(lambda x : x.split('-')[0]))['최저기온(℃)'].min()
# (month_max - month_min).sort_values(ascending=False)

df['월'] = df['일시'].str.split('-').str[1]
# df.groupby(df['일시'].str.split('-').str[1])["평균기온(℃)"].var().sort_values(ascending = False)
df.groupby(df['일시'].str.split('-').str[0])[["월",'평균기온(℃)']].max()

       월  평균기온(℃)
일시
1907  12     18.3
1908  12     27.5
1909  12     29.7
1910  12     28.4
1911  12     28.7
...   ..      ...
2015  12     30.4
2016  12     31.2
2017  12     31.4
2018  12     33.7
2019  10     31.6

[113 rows x 2 columns]

In [152]:
df

,\t\t지점번호,지점명,일시,평균기온(℃),최고기온(℃),\t최고기온시각,최저기온(℃),최저기온시각,일교차
0,108,서울,1907-10-01,13.5,20.7,NaN,7.9,NaN,12.8
1,108,서울,1907-10-02,16.2,22.0,NaN,7.9,NaN,14.1
2,108,서울,1907-10-03,16.2,21.3,NaN,13.1,NaN,8.2
3,108,서울,1907-10-04,16.5,22.0,NaN,11.2,NaN,10.8
4,108,서울,1907-10-05,17.6,25.4,NaN,10.9,NaN,14.5
...,...,...,...,...,...,...,...,...,...
40483,108,서울,2019-10-07,14.8,17.9,00:01,13.3,23:09,4.6
40484,108,서울,2019-10-08,14.7,19.8,14:42,10.6,23:31,9.2
40485,108,서울,2019-10-09,13.6,20.4,14:41,7.7,07:04,12.7
40486,108,서울,2019-10-10,15.2,19.8,15:08,10.7,02:15,9.1
40487,108,서울,2019-10-11,18.8,26.1,15:48,13.0,06:59,13.1

> 강사님

In [211]:
# 역대 최고기온의 날짜?
df.sort_values('고온', ascending=False).iloc[0]#['일시']

일시    2018-08-01
평온          33.6
고온          39.6
저온          27.8
Name: 40051, dtype: object

In [201]:
# skiprows : 맨 위의 11줄은 무시하고 불러옴
df = pd.read_csv('./pandas_datafiles/seoul_weather.csv', encoding = 'cp949', skiprows=11)

In [202]:
df.head(2)

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃) \t최고기온시각  최저기온(℃) 최저기온시각
0       108  서울  1907-10-01     13.5     20.7      NaN      7.9    NaN
1       108  서울  1907-10-02     16.2     22.0      NaN      7.9    NaN

In [203]:
# 필요없는 자료 삭제
df.drop(['\t\t지점번호','지점명','\t최고기온시각', '최저기온시각'], axis = 1, inplace = True)
df.head(2)

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0  1907-10-01     13.5     20.7      7.9
1  1907-10-02     16.2     22.0      7.9

In [216]:
# 일교차가 가장 큰 월? (평균적으로 일교차가 가장 큰 월?)
df['일교차'] = df['고온'] - df['저온']
df['월'] = df.일시.apply(lambda x : x.split('-')[1])

               일시    평온    고온    저온   일교차   월
0      1907-10-01  13.5  20.7   7.9  12.8  10
1      1907-10-02  16.2  22.0   7.9  14.1  10
2      1907-10-03  16.2  21.3  13.1   8.2  10
3      1907-10-04  16.5  22.0  11.2  10.8  10
4      1907-10-05  17.6  25.4  10.9  14.5  10
...           ...   ...   ...   ...   ...  ..
40483  2019-10-07  14.8  17.9  13.3   4.6  10
40484  2019-10-08  14.7  19.8  10.6   9.2  10
40485  2019-10-09  13.6  20.4   7.7  12.7  10
40486  2019-10-10  15.2  19.8  10.7   9.1  10
40487  2019-10-11  18.8  26.1  13.0  13.1  10

[40488 rows x 6 columns]

In [221]:
# df.groupby('월')['일교차'].mean().sort_values(ascending = False).index[0]
df.groupby('월')['일교차'].mean().sort_values(ascending = False).iloc[:1]

월
10    10.909529
Name: 일교차, dtype: float64

In [234]:
# 월교차(월간 온도 분산)가 가장 큰 년도???
df['년'] = df.일시.apply(lambda x : x.split('-')[0])
df.groupby(['년','월'])['평온'].mean().unstack().std(axis=1).sort_values(ascending = False).iloc[:1]

년
1917    12.088418
dtype: float64

In [231]:
# 일의 평균기온 => 월의 평균기온 => unstack() => 1년기준 월의 평균기온 표준편차구하기
df.groupby(['년','월'])['평온'].mean()

년     월
1907  10    13.896774
      11     5.310000
      12    -3.890323
1908  01    -3.464516
      02    -4.058621
              ...
2019  06    22.503333
      07    25.877419
      08    27.190323
      09    22.643333
      10    18.490909
Name: 평온, Length: 1331, dtype: float64

In [232]:
df.groupby(['년','월'])['평온'].mean().unstack()

월,01,02,03,04,05,06,07,08,09,10,11,12
년,,,,,,,,,,,,
1907,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.896774,5.310000,-3.890323
1908,-3.464516,-4.058621,2.919355,10.060000,14.851613,20.743333,23.474194,24.332258,19.326667,13.590323,3.623333,-0.816129
1909,-2.509677,-3.253571,1.764516,10.380000,15.441935,20.566667,24.554839,25.316129,20.153333,12.225806,5.203333,-3.432258
1910,-2.258065,-3.407143,2.451613,9.886667,16.341935,19.763333,23.296774,24.241935,19.113333,13.703226,5.496667,-4.616129
1911,-4.961290,-1.071429,3.961290,9.423333,15.622581,20.300000,23.480645,25.019355,20.790000,11.554839,6.016667,-2.964516
...,...,...,...,...,...,...,...,...,...,...,...,...
2015,-0.935484,1.042857,6.290323,13.326667,18.883871,23.586667,25.835484,26.267742,22.390000,15.506452,8.900000,1.593548
2016,-3.200000,0.193103,7.045161,14.066667,19.558065,23.596667,26.235484,27.996774,23.083333,16.080645,6.773333,1.245161
2017,-1.829032,-0.246429,6.325806,13.933333,19.490323,23.273333,26.922581,25.916129,22.103333,16.409677,5.626667,-1.929032
2018,-3.977419,-1.646429,8.080645,12.986667,18.167742,23.136667,27.796774,28.761290,21.496667,13.054839,7.793333,-0.606452
2019,-0.896774,0.985714,7.093548,12.120000,19.419355,22.503333,25.877419,27.190323,22.643333,18.490909,NaN,NaN